jpearman/stm32flashCortex/main.c
/*---------------------------------------------------------------------------*/
/*                                                                           */
/*        Module:     main.c                                                 */
/*        Author:     James Pearman                                          */
/*        Created:    11 Aug 2012                                            */
/*                                                                           */
/*        Revisions:  V0.1                                                   */
/*                                                                           */
/*---------------------------------------------------------------------------*/
/*                                                                           */
/*        Description:                                                       */
/*                                                                           */
/*        VEX cortex version of the stm32flash download software             */
/*                                                                           */
/*        Major changes as follows:                                          */
/*        Ability to enter the user boot mode by either RTS toggling or      */
/*        C9 commands.                                                       */
/*        Auto baud retry up to 4 times.                                     */
/*        removal of reset code download to RAM, not necessary with the      */
/*        refactoring of this file for easier reading                        */
/*        change of default baudrate to 115200, the only speed at which      */
/*        this will work with the cortex.                                    */
/*        addition of a "quiet" mode to skip debug and progress printing     */
/*                                                                           */
/*        Revision 27 Oct 2013                                               */
/*        Improved serial control, now detects if the cortext is in flash    */
/*        load mode.  Requests system status prior to sending init sequence  */
/*        simplified status output that plays well with eclipse.             */
/*        fixed bug in win serial device open.                               */
/*        workaround in serial_open for OSX so that new prog cable can be    */
/*        used                                                               */
/*                                                                           */
/*        Revision 24 Match 2014                                             */
/*        Improved compatibility with the new VEX USB programming cable      */
/*        under OSX 10.9.                                                    */
/*        Improved status display, percentages now correctly shown for       */
/*        smaller (ie. pros) downloads.                                      */
/*        OSX builds for 64 and 32 bit ans is compatible with 10.6-10.9      */
/*                                                                           */
/*---------------------------------------------------------------------------*/
/*                                                                           */



/*
  stm32flash - Open Source ST STM32 flash program for *nix
  Copyright (C) 2010 Geoffrey McRae <geoff@spacevs.com>
..Copyright (C) 2011 Steve Markgraf <steve@steve-m.de>

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
*/

#include <sys/types.h>
#include <sys/stat.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>

#include "utils.h"
#include "serial.h"
#include "stm32.h"
#include "parser.h"

#include "parsers/binary.h"
#include "parsers/hex.h"

/* device globals */
serial_t        *serial         = NULL;
stm32_t         *stm            = NULL;

void            *p_st           = NULL;
parser_t        *parser         = NULL;

/* settings */
char            *device         = NULL;
serial_baud_t   baudRate        = SERIAL_BAUD_115200;
int             rd              = 0;
int             wr              = 0;
int             wu              = 0;
int             npages          = 0xFF;
char            verify          = 0;
int             retry           = 10;
char            exec_flag       = 0;
uint32_t        execute         = 0;
char            init_flag       = 1;
char            force_binary    = 0;
char            reset_flag      = 1;
char            *filename;

int             vex_user_program = 1;  // now default to yes
char            quietmode        = 0;

/* functions */
int     vex_detect_mode( void );
int     vex_initialize( void );

int     vex_sys_status_cmd( void );
int     vex_reset_slave_cmd( void );
int     vex_enter_user_program_cmd( void );
int     vex_enter_user_program_rts( void );

int     read_flash( void );
int     write_unprotect_flash( void );
int     write_flash( void );
void    cleanup( void );
parser_err_t    open_parser(void);

int  parse_options(int argc, char *argv[]);
void show_help(char *name);

/*---------------------------------------------------------------------------*/
/*                                                                           */

int main(int argc, char* argv[])
{
        int ret = 1;
        parser_err_t perr;
        
