jpearman/stm32flashCortex/main.c
        if (parse_options(argc, argv) != 0)
            return(0);

        if(!quietmode){
            printf("VEX cortex flash loader\n");
            // added to help with eclipse tool management
            printf("Working directory %s\n\n", getcwd(NULL, 0));
            }    

        // Open file parser
        perr = open_parser();

        if( perr != PARSER_ERR_OK )
            return(perr);

        // Open serial device            
        serial = serial_open(device);
        if (!serial) {
            perror(device);
            cleanup();
            return(-1);
            }

        // Setup serial port for bootloader
        if (serial_setup( serial, baudRate, SERIAL_BITS_8, SERIAL_PARITY_EVEN, SERIAL_STOPBIT_1) != SERIAL_ERR_OK) {
            perror(device);
            cleanup();
            return(-1);
            }

		// user may have pressed program button so test if we are
        // already in boot load mode waiting for INIT or if we already
        // have sent auto baud
        if( vex_detect_mode() ) {
	        if( vex_initialize() != 1 ) {
                cleanup();
                return(-1);
                }
            }
            
        // We may have change parity if not in bootloader mode
        // Setup serial port for bootloader
        if (serial_setup( serial, baudRate, SERIAL_BITS_8, SERIAL_PARITY_EVEN, SERIAL_STOPBIT_1) != SERIAL_ERR_OK) {
            perror(device);
            cleanup();
            return(-1);
            }

        // 1/10 sec delay before comms start
        usleep(100000);

        // RTS needs to be low for user program to be reset - no idea why
        // May need to do something with the DTR line for the USB, not sure yet
        //
        serial_set_rts( serial, 0 );

        // 1/10 sec delay before comms start
        usleep(100000);
                
        // Init the STM32 communicationst
        // we may already be in bootload mode
        if (!(stm = stm32_init(serial, init_flag))) {
            cleanup();
            return(-1);
            }

        if(!quietmode) {
            // Print some info about the cortex
            printf("Version      : 0x%02x\n", stm->bl_version);
            printf("Option 1     : 0x%02x\n", stm->option1);
            printf("Option 2     : 0x%02x\n", stm->option2);
            printf("Device ID    : 0x%04x (%s)\n", stm->pid, stm->dev->name);
            printf("RAM          : %dKiB  (%db reserved by bootloader)\n", (stm->dev->ram_end - 0x20000000) / 1024, stm->dev->ram_start - 0x20000000);
            printf("Flash        : %dKiB (sector size: %dx%d)\n", (stm->dev->fl_end - stm->dev->fl_start ) / 1024, stm->dev->fl_pps, stm->dev->fl_ps);
            printf("Option RAM   : %db\n", stm->dev->opt_end - stm->dev->opt_start);
            printf("System RAM   : %dKiB\n", (stm->dev->mem_end - stm->dev->mem_start) / 1024);
            }
            
        // Read flash if necessary
        if( rd ) {
            if( read_flash() < 0 ) {
                cleanup();
                return(-1);
                }
            }    
        else if (wu) {
            write_unprotect_flash();
            }    
        else if (wr) {
            if( write_flash() < 0 ) {
                cleanup();
                return(-1);
                }
            }   

        // ececute code ?
        if (stm && exec_flag)
            {
            if (execute == 0)
                execute = stm->dev->fl_start;

            if(!quietmode) {
                fprintf(stdout, "\nStarting execution at address 0x%08x... \n", execute);
                fflush(stdout);
                }
            
            if (stm32_go(stm, execute))
                {
                reset_flag = 0;
                if(!quietmode)
                    fprintf(stdout, "done.\n");
                }
            else
                if(!quietmode)
                    fprintf(stdout, "failed.\n");
           }
        
        // deallocate memory etc.
        cleanup();
        
        printf("\n");
        return ret;
}

/*---------------------------------------------------------------------------*/
/*  Try and detect the cortex in flash load mode, either waiting for the     */
/*  initial autobaud sequence or waiting for bootload commands               */
/*  @returns -1 = error or modofied init_flag                                */
/*---------------------------------------------------------------------------*/

int
vex_detect_mode()
{
    char buf[2]  = {0x7F};
    char rep[16] = {0x00};
    int  retry;
    
	// sleep a while
    usleep(100000);
    
    if( serial )
        {
        // Setup serial port for bootloader
        if (serial_setup( serial, baudRate, SERIAL_BITS_8, SERIAL_PARITY_EVEN, SERIAL_STOPBIT_1) != SERIAL_ERR_OK)
            {
            perror(device);
            cleanup();
            return(-1);
            }

		// sleep a while
    	usleep(100000);
        
        // Try sending auto baud a few times and see what we get
        for(retry=0;retry<5;retry++)
            {
            serial_write( serial, buf, 1 );
            if( serial_read( serial, rep, 1) == SERIAL_ERR_OK )
                {
                // Lets ssee what we got
                if( rep[0] == 0x79 )
                    {
                    // we are done, user must have pushed prog button
                    init_flag = 0;
                    return( init_flag );
                    }
                else
                if( rep[0] == 0x1F )
                    {
                    // we are also done, see if we can get status
                    buf[0] = 0x00;
                    buf[1] = 0xFF;
                    serial_write( serial, buf, 2 );
                    // check status is good
                    if( (serial_read( serial, rep, 15) == SERIAL_ERR_OK) && rep[0] == 0x79 )
                        init_flag = 0;
                    // OK, we are already in bootload mode for some reason                    
                    return( init_flag );
                    }
                }
            }
        }
        
    // no luck if we are here, not in bootloader mode.
    return( init_flag );
}

