jpearman/stm32flashCortex/main.c
/*---------------------------------------------------------------------------*/
/*  Initialize vex by sending enter boot load sequence                       */
/*---------------------------------------------------------------------------*/

int
vex_initialize()
{
    char    zero[4] = {0x00, 0x00, 0x00, 0x00};

	// sleep a while
    usleep(100000);
    
    if(serial)
        {        
        // Setup serial port for VEX commands
        if (serial_setup( serial, baudRate, SERIAL_BITS_8, SERIAL_PARITY_NONE, SERIAL_STOPBIT_1) != SERIAL_ERR_OK)
            {
            perror(device);
            cleanup();
            return(-1);
            }
        
        //sleep a while
        usleep(100000);
        
        // send some zeros, there are bugs in serial driver
        serial_write( serial, zero, 4 );

        //sleep a while
        usleep(100000);

        // Check system status
        if( !vex_sys_status_cmd() ) {      
            // sleep a while
            usleep(100000);
            
            // Try again
            if( !vex_sys_status_cmd() ) {
                printf("No VEX system detected\n");
                return(-1);
                }
            }
            
        // Put cortex into boot load mode
        if(vex_user_program == 2)
            vex_enter_user_program_rts();
        else
        if(vex_user_program != 0)
            vex_enter_user_program_cmd();
        return(1);
        }
    return(0);
}

/*-----------------------------------------------------------------------------*/
/*  Get VEX system status                                                      */
/*-----------------------------------------------------------------------------*/

int
vex_sys_status_cmd()
{
    unsigned char    buf[5] = { 0xC9, 0x36, 0xB8, 0x47, 0x21 };
    unsigned char    rep[16];
    
    if(serial)
        {        
        if(!quietmode)
            printf("Send system status request\n");

		// cortex may be sending data so flush
		serial_flush( serial );
		
		// try and get status
        if( serial_write( serial, buf, 5 ) == SERIAL_ERR_OK ) {
            // read reply - should be 14 bytes
            if( serial_read( serial, rep, 14 ) == SERIAL_ERR_OK ) {
                if(!quietmode) {
                    int i;
                    
                    // double check reply
                    if( rep[0] != 0xAA || rep[1] != 0x55 || rep[2] != 0x21 || rep[3] != 0x0A )
                        return(0);
                        
                    // Show reply
                    printf("Status ");
                    for(i=0;i<14;i++)
                        printf("%02X ", rep[i]);
                    printf("\n");
                    
                    // Decode some info
                    printf("Connection       : ");
                    if( (rep[11] & 0x30) == 0x10 )
                        printf("USB Tether\n");
                    else
                    if( (rep[11] & 0x30) == 0x20 )
                        printf("USB Direct connection\n");
                    else
                    if( (rep[11] & 0x30) == 0x00 )
                        printf("WiFi\n");
                    else
                        printf("Unknown\n");
                    
                    if( (rep[11] & 0x30) != 0x20 )
                        printf("Joystick firmware: %d.%02d\n", rep[4], rep[5]);
                    else
                        printf("Joystick firmware: NA\n" );
                        
                    printf("Master firmware  : %d.%02d\n", rep[6], rep[7]);
                    printf("Joystick battery : %.2fV\n", (double)rep[8]  * 0.059);
                    printf("Cortex battery   : %.2fV\n", (double)rep[9]  * 0.059);
                    printf("Backup battery   : %.2fV\n", (double)rep[10] * 0.059);

                    printf("\n");
                    }
                }
            else
                return(0);
            }
        else
            return(0);
        }

    return(1);
}

/*-----------------------------------------------------------------------------*/
/*  Enter user boot by sending Enter bootloader command                        */
/*-----------------------------------------------------------------------------*/

int
vex_enter_user_program_cmd()
{
    char    buf[5] = {0xC9, 0x36, 0xB8, 0x47, 0x25 };
    
    if(serial)
        {        
        if(!quietmode)
            printf("Send bootloader start command\n");

        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
    
        usleep(250000);
        }

    return(1);
}

/*-----------------------------------------------------------------------------*/
/*  Reset the user processor                                                   */
/*-----------------------------------------------------------------------------*/

int
vex_reset_slave_cmd()
{
    char    buf[5] = {0xC9, 0x36, 0xB8, 0x47, 0x24 };
    
    if(serial)
        {        
        if(!quietmode)
            printf("Send reset slave command\n");

        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
        serial_write( serial, buf, 5 );
    
        usleep(250000);
        }

    return(1);
}

/*-----------------------------------------------------------------------------*/
/*  Enter user boot by pulsing RTS line                                        */
/*-----------------------------------------------------------------------------*/

int
vex_enter_user_program_rts()
{
    char    buf[1];
         
	if(serial)
	    {
    	if (serial_setup( serial, SERIAL_BAUD_9600,	SERIAL_BITS_8, SERIAL_PARITY_NONE, SERIAL_STOPBIT_1	) != SERIAL_ERR_OK)
	    	{
		    perror(device);
		    return(0);
	        }
    
        if(!quietmode)
            printf("Send bootloader start command (RTS)\n");

        // send 1 char as driver has a bug
        buf[0] = 0x00;
        serial_write( serial, buf, 1 );
    
        serial_set_rts( serial, 1 );
        usleep(5000);
    
