jpearman/stm32flashCortex/main.c
        serial_set_rts( serial, 0 );
        usleep(15000);

        serial_set_rts( serial, 1 );
        usleep(10000);
        // tx
        buf[0] = 0xF0;
        serial_write( serial, buf, 1 );
    
        usleep(20000);
    
        serial_set_rts( serial, 0 );

        usleep(250000);
        }

    return(1);
}

/*-----------------------------------------------------------------------------*/
/*    Simple progress display that plays well with eclipse                     */
/*-----------------------------------------------------------------------------*/

void
show_progress( int done, int size )
{
    static  int     dot = 0;
    int per;
        
    if(done == 0 )
        dot = 0;
    
    if( done < size ) {
        per = (100 * done / size);  
        if( per / 2 == dot ) {
            if( dot % 5 == 0 )
                fprintf(stdout,"%d", dot*2 );
            else
                fprintf(stdout,".");
            dot++;
            }
        fflush(stdout);
    }
    else {
        // check to see if we made 100%
        if(dot != 51)
            fprintf(stdout,"100" );
        fprintf(stdout,"\n");
    }
}

/*-----------------------------------------------------------------------------*/
/*  Read flash contents to binary file                                         */
/*-----------------------------------------------------------------------------*/

int
read_flash()
{
    parser_err_t perr;
    uint8_t         buffer[256];
    uint32_t        addr;
    unsigned int    len;
    
    if (rd)
        {
        printf("\n");

        if ((perr = parser->open(p_st, filename, 1)) != PARSER_ERR_OK)
            {
            fprintf(stderr, "%s ERROR: %s\n", parser->name, parser_errstr(perr));
        
            if (perr == PARSER_ERR_SYSTEM) perror(filename);
            return(-1);
            }

        addr = stm->dev->fl_start;
        
        show_progress( 0, stm->dev->fl_end - stm->dev->fl_start );
        while(addr < stm->dev->fl_end)
            {
            uint32_t left   = stm->dev->fl_end - addr;
            len             = sizeof(buffer) > left ? left : sizeof(buffer);
            if (!stm32_read_memory(stm, addr, buffer, len))
                {
                fprintf(stderr, "Failed to read memory at address 0x%08x, target write-protected?\n", addr);
                return(-1);
                }
        
            assert(parser->write(p_st, buffer, len) == PARSER_ERR_OK);
            addr += len;

            if(!quietmode) {
                show_progress( addr - stm->dev->fl_start, stm->dev->fl_end - stm->dev->fl_start );
                //fprintf(stdout, "Read address 0x%08x (%.2f%%) \r",addr,
                //                (100.0f / (float)(stm->dev->fl_end - stm->dev->fl_start)) * (float)(addr - stm->dev->fl_start) );
                //fflush(stdout);
                }
            }
            
        if(!quietmode)
            fprintf(stdout, "\nDone.\n");

        return(1);
        }
        
    return(0);
}

/*-----------------------------------------------------------------------------*/
/*  Unprotect flash to allow writing                                           */
/*-----------------------------------------------------------------------------*/

int
write_unprotect_flash()
{
    if (wu)
        {
        if(!quietmode)
            fprintf(stdout, "Write-unprotecting flash\n");
        
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        
        stm32_wunprot_memory(stm);
        
        if(!quietmode)
            fprintf(stdout, "Done.\n");
        
        return(1);
        }
        
    return(0);
}



/*-----------------------------------------------------------------------------*/
/*  Write file to flash                                                        */
/*-----------------------------------------------------------------------------*/

int
write_flash()
{
    uint8_t         buffer[256];
    uint32_t        addr;
    unsigned int    len;
    int             failed = 0;

    if (wr)
        {
        printf("\n");

        off_t   offset = 0;
        ssize_t r;
        unsigned int size = parser->size(p_st);

        if (size > stm->dev->fl_end - stm->dev->fl_start)
            {
            fprintf(stderr, "File provided larger then available flash space.\n");
            return(-1);
            }

        stm32_erase_memory(stm, npages);

        addr = stm->dev->fl_start;

        show_progress( 0, size );
        
        while(addr < stm->dev->fl_end && offset < size)
            {
            uint32_t left   = stm->dev->fl_end - addr;
            len             = sizeof(buffer) > left ? left : sizeof(buffer);
            len             = len > size - offset ? size - offset : len;

            if (parser->read(p_st, buffer, &len) != PARSER_ERR_OK)
                return(-1);
        
            failed = 0;
            
            do
                {
                if (!stm32_write_memory(stm, addr, buffer, len))
                    {
                    fprintf(stderr, "\nFailed to write memory at address 0x%08x\n", addr);
                    return(-1);
                    }

                if (verify)
                    {
                    uint8_t compare[len];
                
                    if (!stm32_read_memory(stm, addr, compare, len))
                        {
                        fprintf(stderr, "\nFailed to read memory at address 0x%08x\n", addr);
                        return(-1);
                        }

                    for(r = 0; r < len; ++r)
                        {
                        if (buffer[r] != compare[r])
                            {
                            if (failed == retry)
                                {
                                fprintf(stderr, "\nFailed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n", (uint32_t)(addr + r), buffer [r], compare[r] );
                                return(-1);
                                }
                            ++failed;
                            }

                        failed = 0;
                        }
                    } 
                }while( failed > 0 );
            
            addr    += len;
            offset  += len;

            if(!quietmode) {
                show_progress( offset, size );
//                fprintf(stdout, "Wrote %saddress 0x%08x (%.2f%%) \r", verify ? "and verified " : "", addr, (100.0f / size) * offset );
//                fflush(stdout);
                }
            }
            
        if(!quietmode)
            if( verify )
                fprintf(stdout,"Verify OK\n");
        
        return(1);
        }
        
    return(0);
}


/*-----------------------------------------------------------------------------*/
/*  close devices                                                              */
/*-----------------------------------------------------------------------------*/

void
cleanup()
{
    usleep(20000);
    
    if (p_st  )
        parser->close(p_st);
        
    if (stm   )
        stm32_close  (stm);
    
    if (serial)
        serial_close (serial);
}

/*-----------------------------------------------------------------------------*/
/*  Try and determine what type of file the user want to download              */
/*-----------------------------------------------------------------------------*/

parser_err_t
open_parser()
{
        parser_err_t perr;

        // Are we writing flash ?
        if (wr)
            {
            /* first try hex */
            if (!force_binary)
                {
                parser = &PARSER_HEX;
                p_st = parser->init();
                if (!p_st)
                    {
                    fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                    return(PARSER_ERR_SYSTEM);
                    }
                }

            if (force_binary || (perr = parser->open(p_st, filename, 0)) != PARSER_ERR_OK)
                {
                if (force_binary || perr == PARSER_ERR_INVALID_FILE)
                    {
                    if (!force_binary)
                        {
                        parser->close(p_st);
                        p_st = NULL;
                        }

                    /* now try binary */
                    parser = &PARSER_BINARY;
                    p_st = parser->init();
                    if (!p_st)
                        {
                        fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                        
                        return(PARSER_ERR_SYSTEM);
                        }
                    perr = parser->open(p_st, filename, 0);
                    }

                /* if still have an error, fail */
                if (perr != PARSER_ERR_OK)
                    {
                    fprintf(stderr, "%s ERROR: %s\n", parser->name, parser_errstr(perr));
                    
                    if (perr == PARSER_ERR_SYSTEM)
                        perror(filename);
                    
                    return(perr);
                    }
                }

