jpearman/stm32flashCortex/main.c
                fprintf(stdout, "Using Parser : %s\n", parser->name);
            }
        else if (rd )
        // reading flash ?
            {
            parser = &PARSER_BINARY;
            p_st = parser->init();
            if (!p_st)
                {
                fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                return(PARSER_ERR_SYSTEM);
                }
            }
            
    return( PARSER_ERR_OK );
}

/*-----------------------------------------------------------------------------*/
/*                                                                             */
/*                                                                             */
/*-----------------------------------------------------------------------------*/

int parse_options(int argc, char *argv[]) {
        int c;
        while((c = getopt(argc, argv, "b:r:w:e:vn:g:GfchuXq012")) != -1) {
                switch(c) {
                        case 'X':
                                if( vex_user_program == 0 )
                                    vex_user_program = 1;
                                break;
                                
                        case '0':
                                vex_user_program = 0;
                                break;
                        case '1':
                                vex_user_program = 1;
                                break;
                        case '2':
                                vex_user_program = 2;
                                break;
                                
                        case 'q':
                                quietmode = 1;
                                break;
                                
                        case 'b':
                                baudRate = serial_get_baud(strtoul(optarg, NULL, 0));
                                if (baudRate == SERIAL_BAUD_INVALID) {
                                        fprintf(stderr, "Invalid baud rate, valid options are:\n");
                                        for(baudRate = SERIAL_BAUD_1200; baudRate != SERIAL_BAUD_INVALID; ++baudRate)
                                                fprintf(stderr, " %d\n", serial_get_baud_int(baudRate));
                                        return 1;
                                }
                                break;

                        case 'r':
                        case 'w':
                                rd = rd || c == 'r';
                                wr = wr || c == 'w';
                                if (rd && wr) {
                                        fprintf(stderr, "ERROR: Invalid options, can't read & write at the same time\n");
                                        return 1;
                                }
                                filename = optarg;
                                break;
                        case 'e':
                                npages = strtoul(optarg, NULL, 0);
                                if (npages > 0xFF || npages < 0) {
                                        fprintf(stderr, "ERROR: You need to specify a page count between 0 and 255");
                                        return 1;
                                }
                                break;
                        case 'u':
                                wu = 1;
                                if (rd || wr) {
                                        fprintf(stderr, "ERROR: Invalid options, can't write unprotect and read/write at the same time\n");
                                        return 1;
                                }
                                break;
                        case 'v':
                                verify = 1;
                                break;

                        case 'n':
                                retry = strtoul(optarg, NULL, 0);
                                break;

                        case 'g':
                                exec_flag = 1;
                                execute   = strtoul(optarg, NULL, 0);
                                break;

                        case 'G':
                                exec_flag = 1;
                                execute   = 0;
                                break;

                        case 'f':
                                force_binary = 1;
                                break;

                        case 'c':
                                init_flag = 0;
                                break;

                        case 'h':
                                show_help(argv[0]);
                                return 1;
                }
        }

        for (c = optind; c < argc; ++c) {
                if (device) {
                        fprintf(stderr, "ERROR: Invalid parameter specified\n");
                        show_help(argv[0]);
                        return 1;
                }
                device = argv[c];
        }

        if (device == NULL) {
                fprintf(stderr, "ERROR: Device not specified\n");
                show_help(argv[0]);
                return 1;
        }

        if (!wr && verify) {
                fprintf(stderr, "ERROR: Invalid usage, -v is only valid when writing\n");
                show_help(argv[0]);
                return 1;
        }

        return 0;
}

/*-----------------------------------------------------------------------------*/
/*                                                                             */
/*                                                                             */
/*-----------------------------------------------------------------------------*/

void show_help(char *name) {
        fprintf(stderr,
#ifdef __WIN32__
                "Usage: %s [-bvngfhc] [-[rw] filename] COM1\n"
#else
                "Usage: %s [-bvngfhc] [-[rw] filename] /dev/tty.usbserial\n"
#endif
                "       -b rate         Baud rate (default 115200)\n"
                "       -X              Enter VEX user program mode\n" 
                "       -X1             Enter VEX user program mode using C9 commands\n" 
                "       -X2             Enter VEX user program mode using old style RTS control\n" 
                "       -r filename     Read flash to file\n"
                "       -w filename     Write flash to file\n"
                "       -u              Disable the flash write-protection\n"
                "       -e n            Only erase n pages before writing the flash\n"
                "       -v              Verify writes\n"
                "       -n count        Retry failed writes up to count times (default 10)\n"
                "       -g address      Start execution at specified address (0 = flash start)\n"
                "       -G              Start execution at flash start address\n"
                "       -f              Force binary parser\n"
                "       -h              Show this help\n"
                "       -q              quietmode, no status messages\n"
                "       -c              Resume the connection (don't send initial INIT)\n"
                "                       *Baud rate must be kept the same as the first init*\n"
                "                       This is useful if the reset fails\n"
                "\n"
                "Examples:\n"
                "       Get device information:\n"
#ifdef __WIN32__
                "               %s -X COM1\n"
#else
                "               %s -X /dev/tty.usbserial\n"
#endif
                "\n"
                "       Write with verify and then start execution:\n"
#ifdef __WIN32__
                "               %s -X -w filename -v -g 0x0 COM1\n"
#else
                "               %s -X -w filename -v -g 0x0 /dev/tty.usbserial\n"
#endif
                "\n"
                "       Read flash to file:\n"
#ifdef __WIN32__
                "               %s -X -r filename COM1\n",
#else
                "               %s -X -r filename /dev/tty.usbserial\n",
#endif
                name,
                name,
                name,
                name
        );
}

